In [31]:
#Importing pandas library
import pandas as pd

In [32]:
!dir

 Volume in drive C has no label.
 Volume Serial Number is 6CFF-A6E8

 Directory of C:\Users\Soori\Desktop\TN-Assignments\TakenMindIntern\Code Practices

03/08/2022  06:08 PM    <DIR>          .
03/08/2022  06:08 PM    <DIR>          ..
03/08/2022  05:07 PM    <DIR>          .ipynb_checkpoints
03/08/2022  05:40 PM               264 File Operations Output.csv
03/08/2022  05:40 PM               264 File Operations Output.txt
03/08/2022  05:24 PM               242 File Operations.csv
03/08/2022  06:00 PM            14,684 File Operations.ipynb
03/08/2022  06:08 PM             9,597 File Operations.xlsx
               5 File(s)         25,051 bytes
               3 Dir(s)   8,536,494,080 bytes free

### 1. Handling CSV files

In [14]:
csvFile1 = pd.read_csv("File Operations.csv")

In [15]:
csvFile1

    ID          Name    Company  Position   Salary   Experience   Awards
0  0.1  Sooriyakumar        NaN   Student        0            0        0
1  1.2        Thamil   Hospital    Doctor   500000            5       10
2  5.5        Amanda  TakenMind        HR   200000            3        5
3  6.2        Shelly     Heroku        DS    10000           10        1
4  8.5         Thaya     School   Teacher   100000            5        2

In [16]:
csvFile2 = pd.read_table("File Operations.csv", delimiter=',')

In [18]:
csvFile2 # We can define the delimiter in read_table function in the pandas library

    ID          Name    Company  Position   Salary   Experience   Awards
0  0.1  Sooriyakumar        NaN   Student        0            0        0
1  1.2        Thamil   Hospital    Doctor   500000            5       10
2  5.5        Amanda  TakenMind        HR   200000            3        5
3  6.2        Shelly     Heroku        DS    10000           10        1
4  8.5         Thaya     School   Teacher   100000            5        2

In [19]:
csvFile3 = pd.read_csv("File Operations.csv", header=None)

In [23]:
type(csvFile3)

pandas.core.frame.DataFrame

In [24]:
csvFile3

     0             1          2          3        4            5        6
0   ID          Name    Company   Position   Salary   Experience   Awards
1  0.1  Sooriyakumar        NaN    Student        0            0        0
2  1.2        Thamil   Hospital     Doctor   500000            5       10
3  5.5        Amanda  TakenMind         HR   200000            3        5
4  6.2        Shelly     Heroku         DS    10000           10        1
5  8.5         Thaya     School    Teacher   100000            5        2

In [28]:
csvFile3.to_csv('File Operations Output.csv', sep='*')

### 2. Handling Excel Files

In [30]:
!pip install xlrd
!pip install openpyxl

Requirement already satisfied: xlrd in g:\softwares\anaconda\lib\site-packages (2.0.1)
Requirement already satisfied: openpyxl in g:\softwares\anaconda\lib\site-packages (3.0.9)
Requirement already satisfied: et-xmlfile in g:\softwares\anaconda\lib\site-packages (from openpyxl) (1.1.0)

In [58]:
pd.read_excel("File Operations.xlsx")

    ID          Name    Company Position
0  0.1  Sooriyakumar        Nil  Student
1  1.2        Thamil   Hospital   Doctor
2  5.5        Amanda  TakenMind       HR

In [50]:
excelFile1 = pd.ExcelFile("File Operations.xlsx")

In [51]:
excelFile1

In [56]:
excelFile1.parse('sheetNo1')

    ID          Name    Company Position
0  0.1  Sooriyakumar        Nil  Student
1  1.2        Thamil   Hospital   Doctor
2  5.5        Amanda  TakenMind       HR

In [57]:
excelFile1.parse('Sheet2')

    ID    Name  Experience  Awards
0  6.2  Shelly          10       1
1  8.5   Thaya           5       2